Revit 2024 API
DuctSettings.RoundDuctSizeSuffix Property
 The round duct size suffix string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string RoundDuctSizeSuffix { get; set; }
Visual Basic
Public Property RoundDuctSizeSuffix As String
	Get
	Set
Visual C++
public:
property String^ RoundDuctSizeSuffix {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace